cask_args appdir: '/Applications'

# Update to latest version of Homebrew
update

# Upgrade any already-installed formulae
upgrade
tap 'homebrew/services'

brew 'zsh'
brew 'zsh-autosuggestions'
brew 'hub'
brew 'ack'
brew 'coreutils'
brew 'grc'
brew 'imagemagick'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'roundup'
brew 'unrar'
brew 'wget'

cask '1password'
cask 'dropbox'
cask 'caffeine'
cask 'sublime-text'
cask 'spectacle'
cask 'firefox'
cask 'google-chrome'
cask 'slack'
cask 'transmission'
cask 'tunnelbear'
cask 'vlc'
cask 'puush'
cask 'ngrok'
cask 'sequel-pro'
cask 'iterm2'
cask 'spotify'
cask 'sourcetree'
cask 'alfred'
cask 'phpstorm'
cask 'docker'
cask 'docker-clean'
cask 'keka'
cask 'macdown'
cask 'aerial'
cask 'whatsapp'