# Make sure we’re using the latest Homebrew
update

# Upgrade any already-installed formulae
upgrade

cask_args appdir: '/Applications'

# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/services'

# Tools
brew 'ack'
brew 'coreutils'
brew 'fish'
brew 'grc'
brew 'libgit2'
brew 'mas'
brew 'node'
brew 'openssl'
brew 'readline'
brew 'roundup'
brew 'unrar'
brew 'wget'

# More recent versions of OSX tools
brew 'curl'
brew 'git'
brew 'grep'
brew 'nano'

# Applications
cask '1password'
cask 'docker'
cask 'dozer'
cask 'dropbox'
cask 'firefox'
cask 'google-chrome'
cask 'insomnia'
cask 'iterm2'
cask 'keepingyouawake'
cask 'keka'
cask 'macdown'
cask 'ngrok'
cask 'notion'
cask 'postico'
cask 'puush'
cask 'raycast'
cask 'sequel-pro'
cask 'slack'
cask 'sourcetree'
cask 'spotify'
cask 'sublime-text'
cask 'sensiblesidebuttons'
cask 'transmission'
cask 'telegram'
cask 'visual-studio-code'
cask 'vlc'
cask 'webstorm'
cask 'whatsapp'

# Screensavers
cask 'aerial'
cask 'brooklyn'

# Fonts
cask 'font-firacode-nerd-font'
cask 'font-hack'
cask 'font-inter'
cask 'font-lato'
cask 'font-open-sans'
cask 'font-open-sans-condensed'
cask 'font-source-code-pro'
cask 'font-source-sans-pro'
cask 'font-source-serif-pro'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
